Documents/ро_Отгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ро_Отгрузка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстатокРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПЛ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефоныПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопроводительныеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестТТН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролерСТК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогПроверил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаказНаряды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.роЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДокументовДЛяПечФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДокументовДЛяПечФорм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Все</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДефВедомость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ро_Отгрузка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	Если ЗначениеЗаполнено(ОБъект.Контрагент) = Ложь ТОгда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбран контрагент ";
		Сообщение.Поле = "Контрагент";
		
		// Привязка объекта к реквизиту формы "вручную"
		Сообщение.КлючДанных = Объект.Ссылка;
		Сообщение.ПутьКДанным = "Объект";
		
		// Сообщение выводится пользователю
		Сообщение.Сообщить();
		Возврат;
	КонецЕСлИ;
	
	Стк = новый Структура();
	Стк.Вставить("Статус","Готово");
	Стк.Вставить("Контрагент",Объект.Контрагент);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗаказНарядов",Стк,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> ТИп("Массив") Тогда Возврат; КонецЕСЛИ;
	Для каждого эл из ВыбранноеЗначение Цикл
		мас = Объект.ЗаказНаряды.НайтиСтроки(Новый Структура("ЗаказНаряд",Эл));
		Если Мас.Количество()<>0 Тогда Продолжить; КонецЕсли;
		
		ОБъект.ЗаказНаряды.Добавить().ЗаказНАряд = Эл;	
	КонецЦикла;

КонецПроцедуры

&НасервереБезКонтекста
Функция ПечатныеФормыНаСервере(ссДок,Имя)
	Если ЗначениеЗаполнено(ссДОк)=Ложь Тогда Возврат Неопределено; КонецЕсли; 
	
	Если Имя = "ТТН" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Отгрузка.ПечатьТТН(ссДок);
	ИНачеЕсли Имя = "ТТНЦепочка" Тогда
		имя = Имя+" "+ссДок.Номер;
		Возврат Документы.ро_Отгрузка.ПечатьТТН(ссДок,Истина);
	ИНАче
		Возврат Справочники.ПечатныеФормы.ПечатьПоКодуФормы(ссДок,Имя);
	КонецЕСЛИ;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда) Экспорт
	
	Если ОбщийКлиент.ПроверкаМодифицированности(ЭтаФорма,команда)=Ложь Тогда Возврат; КонецЕсли;
	
	ИмяКодМакета = СокрЛП(Команда.Имя);
	Таб = ПечатныеФормыНаСервере(Объект.Ссылка,ИмяКодМакета);
	Если Таб = Неопределено Тогда Возврат; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",Новый Структура("Результат,Заголовок",Таб,ИмяКодМакета),,Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Справочники.ПечатныеФормы.ДобавитьКнопкиПечати(ЭтаФорма,Объект.Контрагент,Перечисления.ВидыДокументовДЛяПечФорм.Расход);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Контрагент_Реквизиты(сс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.ПунктПогрузки КАК ПунктПогрузки,
	               |	Контрагенты.Подписант КАК Подписант,
	               |	Контрагенты.ПодписантДолжность КАК ПодписантДолжность
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Сс);
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Стк = Новый Структура;
	Для каждого Кол из ТБл.Колонки Цикл
		Стк.вставить(Кол.имя,ТБл[0][Кол.имя]);
	Конеццикла;
	
	
	Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
	Стк = Контрагент_Реквизиты(Объект.Контрагент);
	Если ЗначениеЗаполнено(Объект.ПунктРазгрузки)=ложь Тогда
		Объект.ПунктРазгрузки = Стк.ПунктПогрузки;
	КонецЕСЛИ;
	Объект.Подписант = Стк.Подписант;
	Объект.ПодписантДолжность = Стк.ПодписантДолжность;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПЛ(Команда)
	открытьФорму("Документ.ро_Отгрузка.Форма.ФормаЗагрузкаПЛ",,ЭтаФорма,ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ПунктРазгрузки) Тогда
		Мас = новый Массив;
		Мас.Добавить(Объект.Контрагент);
		Мас.Добавить(Объект.ПунктРазгрузки);
		ФоновыеЗадания.Выполнить("глСервер.ПроставитьПунктПогрузки",Мас);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ГосНомерОкончаниеВводаТекстаНаСервере(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТС КАК СпрТС
	               |ГДЕ
	               |	СпрТС.Код = &Код";
	
   Запрос.УстановитьПараметр("Код",Текст);
   Мас= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
   Спк = новый СписокЗначений;
   Спк.ЗагрузитьЗначения(Мас);
   Возврат Спк;
   
	
КонецФункции


&НаКлиенте
Процедура ГосНомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ДанныеВыбора = ГосНомерОкончаниеВводаТекстаНаСервере(Текст);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТС(сс)
	
	   Стк = Новый Структура("ГосНомер,ТС,ВодительФИО,Перевозчик,АдресПеревозчика");
	   ЗаполнитьЗначенияСвойств(Стк,Сс);
	   
	   Стк.Вставить("ДатаПЛ",ТекущаяДАта());
	   
	   Возврат Стк;
	
КонецФункции

&НаКлиенте
Процедура ГосНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Стк = ПолучитьТС(ВыбранноеЗначение);
		ЗаполнитьЗначенияСвойств(Объект,Стк);
	КонецЕСЛИ;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьАвто(Команда)
	оо = новый ОписаниеОповещения("ПослеВводаНовогоТС",ЭтотОбъект);
	
	Парам = Новый Структура("сс");
	
	ОткрытьФорму("Справочник.ТС.Форма.ФормаЭлемента",Парам,Этаформа,ЭтаФорма,,,оо,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВводаНовогоТС(РезультатЗакрытия,Параметры) Экспорт
	ГосНомерОбработкаВыбора(Неопределено, РезультатЗакрытия, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСправочникТС(Команда)
		ОткрытьФорму("Справочник.ТС.ФормаСписка");
КонецПроцедуры
